Revit 2027 API
IFCExternalServiceUIData.GetRevitElementIds Method
 return the list of revit Element Ids
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetRevitElementIds()
Public Function GetRevitElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetRevitElementIds()
member GetRevitElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
IFCExternalServiceUIData Class
Autodesk.Revit.UI Namespace